Repository: apertium/apertium-sme-smj
Catalog: tmx_data/supntestdata.tmx
Source language: sme
Languages: smj

source: Skutervuoddji, gii lei lahka 20-jahkásaš, váldui de mielde dearvvašvuođaguovddážii varraiskosiid váldit.
smj: Skuvtarvuoddje, guhti lij vargga 20 jagák, váldeduváj de maŋen varresvuodaguovdátjij varraåtsålvisájt váldátjit. SUPN-OK

source: Dat gohčoduvvo vahátjávkadeapmin (skadefelling), ja dasa galgá sierralobi ohcat.
smj: Dat gåhtjuduvvá vahákjávkkadibmen (*skadefelling), ja dasi galggá sierraloabev åhtsåt. SUPN-OK

source: Sihke juoigan- ja lávlunoasi fágajury lei duđavaš vuitiiguin ja mii illudit Lávre gullat Beassášmárkaniin Guovdageainnus boahtte jagi, dadjá Gaup.
smj: Sihke juojggam- ja lávllomoase fáhkajuvrij lij dudálasj vuojttij ja ávvudip Lávrev gulátjit Bæssásjmárnánin Guovddagæjnon boahtte jage, javllá Gaup. SUPN-OK

source: Sihke juoigan- ja lávlunoasi fágajury lei duđavaš vuitiiguin ja mii illudit Máhtte Ánte J. Sara ja Hilda Länsman ja Lávre gullat Beassášmárkaniin Guovdageainnus boahtte jagi, dadjá Gaup.
smj: Sihke juojggam- ja lávllomoase fáhkajuvrij lij dudálasj vuojttij ja ávvudip Máhtte Ánte J. Sara ja Hilda Länsman ja Lávre gulátjit Bæssásjmárnánin Guovddagæjnon boahtte jage, javllá Gaup. SUPN-OK, PROBLEM:WO

source: Nystad muitala ahte dábálaš doaktárat eai nákcen čoavdit dan.
smj: Nystad subtsas dábálasj dåktåra ettjin nagá tjoavddet dav. SUPN-OK

source: Dál áigot sii hástalit suohkaniid váldit dan ovddasvástádusa.
smj: Dálla ájggu sij hásstalit suohkanijt váldátjit dav åvdåsvásstádusáv. SUPN-OK WO

source: Ronja-Katrin sávvá ahte rabasvuohta gájošii eanet olbmuid ja ávžžuha buohkaid rahpasit muitalit váttis áššiid birra.
smj: Ronja-Katrin sávvá ahte rabásvuohta luluj gádjot ienep ulmutjijt ja ávttji gájkajt rahpasit subtsastit gássjelis ássjij birra. SUPN-OK

source: Mii earát maid fertet leat seamma duostilat ja rahpasit muitalit váttis áššiid birra, go dalle sáhttit eastadit psyhkalaš váttuid ja iešsorbmenjurdagiid.
smj: hæhttup aj liehket sæmmi duosstela ja rahpasit subtsastit gássjelis ássjij birra, gå dalloj máhttep psykalasj vigijt ja iesjsårmmimájádusájt hieredit. SUPN-OKPROBLEM:VERB

source: Oallugat jorgalit mánáid ovddosguvlui čohkkát ovdal dan agi mii lea ávžžuhuvvon.
smj: Moattes jårggåli mánájt åvdås guovlluj tjåhkkåhittjat åvddål dan álldara mij la ávttjiduvvam. SUPN-OK

source: Trygg Trafikk ávžžuha mánáid čohkkát maŋosguvlui dassážii go leat unnimusat 4 jagi boarrásat.
smj: Trygg Trafikk ávttji mánájt tjåhkkåhittjat maŋus guovlluj dallutjij gå li unnemusá 4 jage vuorrasa. SUPN-OK

source: Dál lea Mathias Vars Hætta (15) ieš doarvái boaris searvat ja geahččalit vuoitit biilacrossa gilvvuid.
smj: Dálla l Mathias Vars Hætta (15) iesj nuoges boares sebratjit ja gæhttjalittjat vuojttet bijllakråssa gilppusijt. SUPN-OK

source: Sámediggeráđđi lea beahtahallan go Álttá suohkan ii atte vejolašvuođa ge šat iskat makkár čovdosiid sáhttá gávdnat sámi mánáidgárdedilis.
smj: Sámedikkeráde l hådjånam gå Áltá suohkan ij vån vatte máhttelisvuodav åtsådittjat makkir tjoavddusijt máhttá sáme mánájgárddedilen gávnnat. SUPN-OK QUESTION: vån

source: Ággan lei earret eará go bajásšaddansuorggis lea heajos ruhtadilli ja go lea beare oanehis áigi virgádit olbmuid dahje sirddašit dárogiel mánáidgárdeossodagaid eará visttiide.
smj: Sivvan lij duola degu gå bajássjaddamsuorgen la hæjos ruhtadille ja gå la ilá oanegis ájgge ulmutjijt virgádittjat jali sirdátjit dárogiela mánájgárddeåssudagájt ietjá huodnahijda. PROBLEM: COOR SUPN

source: Lea váttis diehtit supmi das go mii eat sáhte priváhta mánáidgárddiide ohcat ruđa.
smj: Le gássjel diehtet summav dassta gå ep máhte priváhta mánájgárdijda rudáv åhtsåt. SUPN-OK

source: Son ii áiggo gal dadjat ledje go Álttás dohkálaš ákkat hilgut doarjagiid.
smj: Ij ájgo gal javllat lidjin gus Áltán dågålasj sivá dårjajt hilgotjit. SUPN-OK

source: Bivddu dieđuid mielde galget guolásteaddjit oaidnán ahte ruoššaluossa johtá stuora spierruin, ja nu livččii álki bivdit daid mearas juo.
smj: Bivdo diedoj milta galggi guollebivdde vuojnnám ruossjaluossa jåhtå stuora biergájn, ja nav luluj álkke bivddet dajt meran juo. SUPN-OK, PROBLEM:LOC

source: Otne luitet beatnagiid ohcat navdon jápmán olbmo.
smj: Uddni luojtti bednagijt åtsåtjit jáhkeduvvam jábmám ulmutjav. SUPN-OK

source: Dál eat boađe nu vánddardit guovllus, ulbmil lea diktit beatnagiid bargat, dadjá Boazopolitiija operašuvdnajođiheaddji Magne Persen.
smj: Dálla ep sjatta nav vándardit guovlon, ulmme l dibddet bednagijt barggat, javllá Boatsojpolitijja operasjåvnnåjådediddje Magne Persen. SUPN-OK

source: Mii fertet šaddat áŋgireabbon eahpesávahahtti daguid dieđihit dahje bissehit.
smj: Hæhttup sjaddat vissjalabbon iehpesávadahtte dagojt diededittjat jali ganugahtátjit. SUPN-OK

source: Leat go son doarvái čeahpit atnit dan vejolašvuođa?
smj: Lep gus nuoges tjiehpe dav máhttelisvuodav adnátjit?

source: Mannan skuvlajagis leat sii hirbmadit bártidan gávdnat sadjásašoahpaheaddji Gorravári sámi luohkáide, ja oahpaheaddjit doppe leat šaddan váldit badjelasaset daid lassi diimmuid.
smj: Åvdep skåvllåjagen li sij harmmat vájvástuvvam gávnnat sadjásasjåhpadiddjev Gorraváre sáme klássajda, ja åhpadiddje dåppe li vierttim válldet dajt lasse tijmajt. VÁJVÁSUVVAT + SUPN?

source: Olgešbellodaga vuosttaš áirras Davveguovllu válgabiirres Hege Christin Bjørkmann ii loga veadjetmeahttumin oahppat sámegiela ja šaddat sámegieloahpaheaddjin jus duođas dáhttu.
smj: Oalgesbelludagá vuostasj ájras Nuorttaguovlo válggabijran Hege Christihin Bjørkmann ij javla ij la vejulattjan oahppat sámegielav ja sjaddat sámegielåhpadiddjen jus duodaj sihtá. SUPN-OK, PROBLEM:VERB

source: Ávžžuha fuomášuhttit doarjagiid.
smj: Ávttji dårjajt huomájahttet. SUPN-OK

source: Lea hui duođalaš ášši, mii boahtá erenomážit čuohcat boazodollui.
smj: Le huj duodalasj ássje, mij ájnnasit sjaddá vájkkudit ællosujttuj. SUPN-OK

source: Leaba ilus go lean vuolgán deike, muhto čuožžilii veahá eahpádus go muitalin ahte boađán lohkkadit iežan láhkkiide jus dárbu.
smj: Læbá ávon gå lav diehki vuolggám, valla tjuodtjelij vehi juorrulibme gå subtsastiv ahte sjattav lássit iehtjam tjehtigijda jus la dárbbo. SUPN-OK

source: Vearroetáhtta ja Válgadirektoráhtta galget dál váldit ovddasvástádusa divvut dan.
smj: Værroetáhtta ja Válggadirektoráhtta galggi dálla åvdåsvásstádusáv válldet divvot dav. SUPN-OK??

source: Ledje 14 olbmo dan čoahkkimis, ja leat bidjan olu bargonávccaid maŋemus vahkuid iskat ja suokkardit gos sis leat boasttuvuođat dáhpáhuvvan, ja sis ledje buorit vástádusat.
smj: Ledjin 14 ulmutja dan tjåhkanimen, ja li edna barggofámojt biedjam maŋemus vahkojt åtsådittjat ja guoradalátdittjat gånnå siján li boastovuoda dáhpáduvvam, ja siján lidjin buorre vásstádusá. SUPN-OK

source: Jahkásaččat lágiduvvo kampánja mii galggašii movttiidahttit ja muittuhit nissonolbmuid čađahit goaŧŧočottaiskkadeami.
smj: Jahkásattjat ásaduvvá kampánnja mij galgaluluj måvtåstuhttet ja mujttádit nissunijt tjadádittjat skoahtonjálmmeåtsålvisáv. SUPN-OK

source: Lea buorre jus studeanttat ožžot eanet stipeandda ja ahte šaddá geasuheaddjin sidjiide go gávdnet liigenávccaid váldit oahpu mii lea sámegillii, lohká Sámi allaskuvlla prorektor Ylva Jannok Nutti Ávvirii.
smj: Le buorre jus studenta oadtju ienep stipendav ja jut sjaddá hullijiddje sidjij gå gávnni lijggefámojt váldátjit oahpov mij la sámegiellaj, javllá Sáme allaskåvlå prorievtor Ylva Jannok Nutti Ávvirij. SUPN-OK, PROBLEM: WO

source: Sii leat geatnegahttán iežaset bargat unnimusat golbma jagi dan suohkanis mii lea sin stipeandaoasi addán studentii.
smj: Sij li vælggogissan dahkam ietjasa bargatjit unnemusát gålmmå jage dan suohkanin mij la sijá stipænndaoasev vaddám studænntaj. SUPN-OK

source: Áidna maid sáhttit dahkat lea váidit ášši politiijaide ja gáibidit ahte čuovvulit ášši, čilge Runar Myrnes Balto.
smj: Ájnna majt máhttep dahkat la ássjev gujddit politijjajda ja gájbbedit jut tjuovvoli ássjev, tjielggi Runar Myrnes Balto. SUPN-OK

source: Mun njulgestaga liikon leat ovttas olbmuiguin ja suohtastallat.
smj: Mån tjielggasit lijkkuv ulmutjij siegen liehket ja suohtastallat. SUPN-PROBLEM: LIJKKUT

source: Lea oba olu reaškkas go deaivvadan ustibiiguin ja mun geahččalan singuin deaivvadit nu dávjá go lea vejolaš.
smj: Le åbbå ållo boagostibme gå rádnajt æjvvalav ja gæhttjalav sijájn æjvvalit nav álu gå åvvå máhttelis. SUPN-OK??

source: Mis lea buorre mokta ja mis lea duođaid dáhttu gávdnat čovdosiid ja gullat sin váibmoáššiid maid dáhttot vuoruhit ovddasguvlui.
smj: Miján la buorre miella ja miján la duodaj miella gávnnat tjoavddusijt ja gullat sijá vájmmoássjij birra majt sihti åvddålij guovlluj vuorodit. SUPN-MIELLA?

source: Mun in leat ollen visot bargat maid livččen háliidan.
smj: Iv la jåksåm divna barggat majt luluv sihtam.

source: Professor emeritus Vuokko Hirvonen lei plánen sosionoman bargat, muhto geasuheaddji studeanttaeallin ja Harald Gaski rievdadii su bálgáid akademalaš máilbmái.
smj: Emerihta professåvrrå Vuokko Hirvonen lij plánim sosionåvmmån barggat, valla giesediddje studentaiellem ja Harald Gaski rievddadij suv bálggájt akademijjalasj væráldij. SUPN-OK

source: Go ledjen leamašan allaskuvllas oanehaš, de nákkáhallen váldit doavttirgrádaoahpu 1999:s.
smj: Gå lidjiv allaskåvlån oanegattjav læhkám,de disputierijiv váldátjit dåktårgrádaoahpov jagen 1999. SUPN-OK

source: Eará mainna Hirvonen garrasit barggai lei oažžut doavttergráda oahpahusa allaskuvlii.
smj: Ietjá majna Hirvonen garrasit bargaj lij dåktårgráda åhpadusáv oadtjot allaskåvllåj. SUPN-OK

source: Mánnodaga bovde Sámi allaskuvla gullat dan prošeavtta birra, go dalle lea digitála logaldallan «Sámi mánáid oahppama ođđa áiggis».
smj: Mánnodagá bivddi Sáme allaskåvllå gulátjit dan prosjevta birra, gå dalloj la digitála lågådallam «Sáme mánáj oahppam ådå ájgen». SUPN-OK

source: Go NSR fas 2017 čavčča vuittii válggaid ja válde eanetlogu, de NSR válljii joatkit vieru ja virgádit Bargiidbellodaga dievasčoahkkinjođiheaddjin.
smj: Gå NSR vas 2017 tjavtja vuojtij válgajt ja válldin ieneplågov, de NSR válljij joarkket dábev ja virgádit Barggijbelludagá ållestjåhkanimjådediddjen. SUPN-OK

source: Sin redakšuvnna bealis lea guhká leamaš jurdda ráhkadit sámi reality tv-prográmma mas boazovázzit ohcet ráhkisvuođa.
smj: Sijá redaksjåvnå bieles la guhkev læhkám ájádus dahkat sáme reality tv-prográmmav manna ællobargge åhtsi gieresvuodav. SUPN-OK

source: Mis lea ambišuvdna doalahit daid bargiid geat leat dálá mánáidgárddis, ja gávdnat beaivválaš jođiheaddji gii sáhttá bargat bargguid min fitnodagas maid, dadjá son.
smj: Miján la ambisjåvnnå bisodit dajt barggijt gudi li dálásj mánájgárden, ja gávnnat bæjválasj jådediddjev guhti máhttá bargojt barggat mijá vidnudagán aj, javllá sån. SUPN-OK, PROBLEM:VERB

source: Norga lea geatnegahttán iežas sihke rievttalaččat ja politihkalaččat suddjet ja ovddidit min giela.
smj: Vuodna l vælggogissan dahkam ietjas sihke rievtugit ja politihkalattjat suoddjitjit ja åvdedittjat mijá gielav. SUPN-OK

source: Ráđđádallanortnet geatnegahttá maiddái Sámedikki.
smj: Rádudallamårdnik vælggogissan dahká Sámedikkev aj. SUPN-OK

source: Sámediggi áigu oččodit sámi mánáide individuála vuoigatvuođa oažžut sámi mánáidgárdefálaldaga.
smj: Sámedigge ájggu sáme mánájda åttjudit indivijdalasj rievtesvuodav oattjotjit sáme mánájgárddefálaldagáv. SUPN-OK

source: Sunná ávžžuha buohkaid rahpasit muitalit váttis áššiid birra.
smj: Sunná ávttji gájkajt rahpasit subtsastit gássjelis ássjij birra. SUPN-OK

source: Mis lea višuvdna ja buolli beroštupmi nannet fitnodagaid ja birrasa vai sii bohtet eanet oidnosii ja šaddet gievrrabut gilvalit.
smj: Miján la visjåvnnå ja buolle berustibme vidnudagájt ja birrasav nannit vaj sij båhti ienebut vuojnnusij ja sjaddi gievrabu gilppot. SUPN+?
